; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared6 - mode
	thermograph3 - mode
	image1 - mode
	image2 - mode
	infrared5 - mode
	thermograph4 - mode
	image0 - mode
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation0 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image1)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument2 image1)
	(supports instrument2 infrared6)
	(supports instrument2 image0)
	(supports instrument2 infrared5)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(have_image Star6 thermograph3)
	(have_image Star6 image2)
	(have_image Phenomenon7 thermograph4)
	(have_image Planet8 thermograph3)
	(have_image Star9 image0)
	(have_image Star9 thermograph3)
	(have_image Phenomenon10 infrared6)
	(have_image Phenomenon10 image2)
	(have_image Star11 image1)
	(have_image Star12 infrared6)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 11
2. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 11
3. (turn_to satellite1 phenomenon10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon10)
   goals met: 0 of 11
4. (turn_to satellite0 groundstation1 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 11
5. (take_image satellite1 phenomenon10 instrument2 infrared6)
   added: (have_image phenomenon10 infrared6)
   goals met: 1 of 11
6. (take_image satellite1 phenomenon10 instrument2 image2)
   added: (have_image phenomenon10 image2)
   goals met: 2 of 11
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 11
8. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 2 of 11
9. (turn_to satellite0 phenomenon7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 11
10. (take_image satellite0 phenomenon7 instrument1 thermograph4)
   added: (have_image phenomenon7 thermograph4)
   goals met: 3 of 11
11. (turn_to satellite0 planet8 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet8)
   goals met: 3 of 11
12. (take_image satellite0 planet8 instrument1 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 4 of 11
13. (turn_to satellite0 star11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star11)
   goals met: 4 of 11
14. (take_image satellite0 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 5 of 11
15. (turn_to satellite0 star6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star6)
   goals met: 5 of 11
16. (take_image satellite0 star6 instrument1 thermograph3)
   added: (have_image star6 thermograph3)
   goals met: 6 of 11
17. (turn_to satellite0 star9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star9)
   goals met: 6 of 11
18. (take_image satellite0 star9 instrument1 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 7 of 11
19. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 8 of 11
20. (turn_to satellite1 star12 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star12)
   goals met: 8 of 11
21. (take_image satellite1 star12 instrument2 infrared6)
   added: (have_image star12 infrared6)
   goals met: 9 of 11
22. (turn_to satellite1 star6 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star6)
   goals met: 9 of 11
23. (take_image satellite1 star6 instrument2 image2)
   added: (have_image star6 image2)
   goals met: 10 of 11
24. (turn_to satellite1 star9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star9)
   goals met: 10 of 11
25. (take_image satellite1 star9 instrument2 image0)
   added: (have_image star9 image0)
   goals met: 11 of 11
